case-contract/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | moldingFoam contract case
   \\      /  Website      | https://openfoam.org
    \\  /    A nd          | Copyright (C) 2026 Yuki Lu
     \\/     M anipulation |
-------------------------------------------------------------------------------
Description
    Temperature; melt enters at 480 K, the cavity is initially filled with
    air at 300 K. The mould walls are held at the mould temperature,
    cooling the polymer from the start of the injection.
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    inlet
    {
        type            fixedValue;
        value           uniform 480;
    }

    vent
    {
        type            inletOutlet;
        inletValue      uniform 300;
        value           uniform 300;
    }

    walls
    {
        type            fixedValue;
        value           uniform 353;
    }
}

// ************************************************************************* //
